#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [10s elapsed]
module.vehicles_app_service.module.vehicles_app_service_autoscaler.data.azurerm_linux_web_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vehicles_app_service.module.vehicles.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          - "INTEROP_API_MOCKING"                             = "true" -> null
          ~ "NEXT_PUBLIC_BFF_API_MOCKING"                     = "false" -> "true"
          ~ "NODE_ENV"                                        = "development" -> "production"
            # (29 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.Web/sites/io-p-itn-ipatente-vehicles-app-01"
        name                                           = "io-p-itn-ipatente-vehicles-app-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-ipatente/infra/prod"
        }
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.vehicles_app_service.module.vehicles_app_service_staging_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-ipatente-rg-01|io-p-itn-ipatente-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3f5b96f-2206-4498-9166-4d910d3303c8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-ipatente-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-ipatente-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
